<script setup></script>

<template>
  <p>
    Необходимо создать оконное приложение (можно веб-приложение) "Склад"
    (используя любой язык программирования), которое будет подключаться к
    серверу PostgreSQL и конкретно к базе Northwind. В приложении необходимо
    вывести все данные из таблицы products и categories, а также настроить
    возможность работы с этими данными.
  </p>

  <ol id="numlist">
    <li>
      В категории необходимо иметь возможность только создавать новую категорию
      продуктов.
    </li>
    <li>
      Необходимо создать функцию добавления нового продукта, удаления старого
      продукта (по id номеру), поиска продукта (продуктов) по нескольким
      параметра:
    </li>
    <ul>
      <li>по category_id (номеру категории);</li>
      <li>по product_name (названию продукта);</li>
      <li>
        по количеству продуктов units_in_stock (больше или меньше определенного
        значения).
      </li>
    </ul>
  </ol>

  <div class="separator"></div>
</template>
